Учет_документов_20.ДокументыИТорги/src/Documents/Расш1_ВедомостьПередачиДокументов/Расш1_ВедомостьПередачиДокументов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Расш1_ВедомостьПередачиДокументов</name>
  <registerRecords>AccumulationRegister.ОборотыПоПодаркам</registerRecords>
  <registerRecords>InformationRegister.КомуОтвезлиПодарки</registerRecords>
  <registerRecords>InformationRegister.ДоставкаДокументовКурьером</registerRecords>
  <attributes>
    <name>ДокументыРазвозил</name>
    <type>
      <types>CatalogRef.НашиСотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>Подарок1</name>
    <type>
      <types>CatalogRef.ПодаркиДляКлиентов</types>
    </type>
  </attributes>
  <attributes>
    <name>Подарок2</name>
    <type>
      <types>CatalogRef.ПодаркиДляКлиентов</types>
    </type>
  </attributes>
  <attributes>
    <name>Подарок3</name>
    <type>
      <types>CatalogRef.ПодаркиДляКлиентов</types>
    </type>
  </attributes>
  <attributes>
    <name>АвторДокумента</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПроверкиПодарков</name>
    <comment>Надо проверить отвозили ли этому клиенту подарок до определенной даты</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяРазвозитьПодарки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ТЧ_СписокРазвоза</name>
    <attributes>
      <name>ПолучательДокументов</name>
      <type>
        <types>CatalogRef.Клиенты</types>
      </type>
    </attributes>
    <attributes>
      <name>НомераАктов</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>25</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомераУПД</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>25</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомераДоговоров</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>25</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЛУРВы</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>КомплектПоставки</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>СводныйАкт</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>АктСверки</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>СпециальнаяДоставка</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Подарок1</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Подарок2</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Подарок3</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Наименование</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Адрес</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ФИОполучателя</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТелПолучателя</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>УровеньКлиента</name>
      <type>
        <types>EnumRef.УровеньКлиента</types>
      </type>
    </attributes>
    <attributes>
      <name>ВремяОбеда</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>30</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Учет_документов_20.ДокументыИТорги/src/InformationRegisters/КомуОтвезлиПодарки/КомуОтвезлиПодарки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>КомуОтвезлиПодарки</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Подарок1</name>
    <type>
      <types>CatalogRef.ПодаркиДляКлиентов</types>
    </type>
  </resources>
  <resources>
    <name>Подарок1Булево</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Подарок2</name>
    <type>
      <types>CatalogRef.ПодаркиДляКлиентов</types>
    </type>
  </resources>
  <resources>
    <name>Подарок2Булево</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Подарок3</name>
    <type>
      <types>CatalogRef.ПодаркиДляКлиентов</types>
    </type>
  </resources>
  <resources>
    <name>Подарок3Булево</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ДокументыРазвозил</name>
    <type>
      <types>CatalogRef.НашиСотрудники</types>
    </type>
  </resources>
  <resources>
    <name>ДатаПроверкиПодарков</name>
    <comment>Надо проверить отвозили ли этому клиенту подарок до определенной даты</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВремяРазвозитьПодарки</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>ПолучательДокументов</name>
    <type>
      <types>CatalogRef.Клиенты</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Учет_документов_20.ДокументыИТорги/src/Catalogs/Клиенты/Клиенты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Клиенты</name>
  <attributes>
    <name>Адрес</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ФИОполучателя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТелПолучателя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УровеньКлиента</name>
    <type>
      <types>EnumRef.УровеньКлиента</types>
    </type>
  </attributes>
  <attributes>
    <name>ВремяОбеда</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

Учет_документов_20.ДокументыИТорги/src/Documents/Расш1_ВедомостьПередачиДокументов/Forms/ФормаДокумента/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Объект.АвторДокумента = Пользователи.ТекущийПользователь() ;
	
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	КомуОтвезлиПодаркиСрезПоследних.Подарок1,
		|	КомуОтвезлиПодаркиСрезПоследних.Подарок2,
		|	КомуОтвезлиПодаркиСрезПоследних.Подарок3,
		|	КомуОтвезлиПодаркиСрезПоследних.ДокументыРазвозил,
		|	КомуОтвезлиПодаркиСрезПоследних.ДатаПроверкиПодарков,
		|	КомуОтвезлиПодаркиСрезПоследних.ВремяРазвозитьПодарки
		|ИЗ
		|	РегистрСведений.КомуОтвезлиПодарки.СрезПоследних КАК КомуОтвезлиПодаркиСрезПоследних";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Объект.Подарок1 = ВыборкаДетальныеЗаписи.Подарок1;
		Объект.Подарок2 = ВыборкаДетальныеЗаписи.Подарок2;
		Объект.Подарок3 = ВыборкаДетальныеЗаписи.Подарок3;
		Объект.ДокументыРазвозил = ВыборкаДетальныеЗаписи.ДокументыРазвозил;
		Объект.ДатаПроверкиПодарков = ВыборкаДетальныеЗаписи.ДатаПроверкиПодарков;
		Объект.ВремяРазвозитьПодарки = ВыборкаДетальныеЗаписи.ВремяРазвозитьПодарки;
	КонецЦикла;
	
		
КонецПроцедуры

&НаКлиенте
Процедура ТЧ_СписокРазвозаПолучательДокументовПриИзменении(Элемент)
	СсылкаНаСправочник = Элементы.ТЧ_СписокРазвоза.ТекущиеДанные.ПолучательДокументов;
	РеквизитыСправочникаВСтруктуре = ТЧ_СписокРазвозаПолучательДокументовПриИзмененииНаСервере(СсылкаНаСправочник);
	Обед = "Обед";
	Пробел = " ";
	СтрокаТаблицы = Элементы.ТЧ_СписокРазвоза.ТекущиеДанные;
	СтрокаТаблицы.Адрес = РеквизитыСправочникаВСтруктуре.Адрес + Пробел + Обед + Пробел + РеквизитыСправочникаВСтруктуре.ВремяОбеда;
	СтрокаТаблицы.ФИОполучателя = РеквизитыСправочникаВСтруктуре.ФИОполучателя;
	СтрокаТаблицы.ТелПолучателя = РеквизитыСправочникаВСтруктуре.ТелПолучателя;
	СтрокаТаблицы.УровеньКлиента = РеквизитыСправочникаВСтруктуре.УровеньКлиента;
	СтрокаТаблицы.ВремяОбеда = РеквизитыСправочникаВСтруктуре.ВремяОбеда;
	
КонецПроцедуры

&НаСервере
Функция ТЧ_СписокРазвозаПолучательДокументовПриИзмененииНаСервере(СсылкаНаСправочник)
	РеквизитыВСтруктуре = Новый Структура();
			
	//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	Клиенты.Адрес,
		|	Клиенты.ФИОполучателя,
		|	Клиенты.ТелПолучателя,
		|	Клиенты.УровеньКлиента,
		|	Клиенты.ВремяОбеда
		|ИЗ
		|	Справочник.Клиенты КАК Клиенты
		|ГДЕ
		|	Клиенты.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", СсылкаНаСправочник);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока (ВыборкаДетальныеЗаписи.Следующий()) Цикл
	
		РеквизитыВСтруктуре.Вставить("Адрес",ВыборкаДетальныеЗаписи.Адрес);
		РеквизитыВСтруктуре.Вставить("ФИОполучателя",ВыборкаДетальныеЗаписи.ФИОполучателя);
		РеквизитыВСтруктуре.Вставить("ТелПолучателя",ВыборкаДетальныеЗаписи.ТелПолучателя);
		РеквизитыВСтруктуре.Вставить("УровеньКлиента",ВыборкаДетальныеЗаписи.УровеньКлиента);
		РеквизитыВСтруктуре.Вставить("ВремяОбеда",ВыборкаДетальныеЗаписи.ВремяОбеда);
		
		
	КонецЦикла;
	
	Возврат РеквизитыВСтруктуре;
	
		
	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА

КонецФункции
